
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.appinsights-key
* Delete
  * azurerm_key_vault_secret.appinsights-non-prod-key[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.appinsights-key will be created
  + resource "azurerm_key_vault_secret" "appinsights-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg"
      + name                    = "AppInsightsInstrumentationKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.appinsights-non-prod-key[0] will be destroyed
  # (because azurerm_key_vault_secret.appinsights-non-prod-key is not in configuration)
  - resource "azurerm_key_vault_secret" "appinsights-non-prod-key" {
      - id                      = "https://pre-hmctskv-stg.vault.azure.net/secrets/AppInsightsInstrumentationKey/aab2f47bed1a45878dff586fd624894c" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" -> null
      - name                    = "AppInsightsInstrumentationKey" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg/secrets/AppInsightsInstrumentationKey/versions/aab2f47bed1a45878dff586fd624894c" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg/secrets/AppInsightsInstrumentationKey" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "aab2f47bed1a45878dff586fd624894c" -> null
      - versionless_id          = "https://pre-hmctskv-stg.vault.azure.net/secrets/AppInsightsInstrumentationKey" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":717,"Program":"tfcmt","SHA1":"","Vars":{}} -->